[Survived] BlockStatement
api.js:6:33
 
 const BASE_URL = 'https://jsonplaceholder.typicode.com';
 
-export const fetchUsers = () => {
-  return new Promise(resolve => {
-    setTimeout(() => {
-      resolve({ data: users });
-    }, 1000);
-  });
-};
+export const fetchUsers = () => {};
 
 export const fetchPosts = () => {

[Survived] BlockStatement
api.js:7:33
 const BASE_URL = 'https://jsonplaceholder.typicode.com';
 
 export const fetchUsers = () => {
-  return new Promise(resolve => {
-    setTimeout(() => {
-      resolve({ data: users });
-    }, 1000);
-  });
+  return new Promise(resolve => {});
 };
 

[Survived] BlockStatement
api.js:8:22
 
 export const fetchUsers = () => {
   return new Promise(resolve => {
-    setTimeout(() => {
-      resolve({ data: users });
-    }, 1000);
+    setTimeout(() => {}, 1000);
   });
 };

[Survived] BlockStatement
api.js:14:33
   });
 };
 
-export const fetchPosts = () => {
-  return new Promise(resolve => {
-    setTimeout(() => {
-      resolve({ data: posts });
-    }, 1000);
-  });
-};
+export const fetchPosts = () => {};
 
 export const fetchComments = () => {

[Survived] BlockStatement
api.js:15:33
 };
 
 export const fetchPosts = () => {
-  return new Promise(resolve => {
-    setTimeout(() => {
-      resolve({ data: posts });
-    }, 1000);
-  });
+  return new Promise(resolve => {});
 };
 

[Survived] BlockStatement
api.js:16:22
 
 export const fetchPosts = () => {
   return new Promise(resolve => {
-    setTimeout(() => {
-      resolve({ data: posts });
-    }, 1000);
+    setTimeout(() => {}, 1000);
   });
 };

[Survived] BlockStatement
api.js:22:36
   });
 };
 
-export const fetchComments = () => {
-  return new Promise(resolve => {
-    setTimeout(() => {
-      resolve({ data: comments });
-    }, 1000);
-  });
-};
+export const fetchComments = () => {};
 

[Survived] BlockStatement
api.js:23:33
 };
 
 export const fetchComments = () => {
-  return new Promise(resolve => {
-    setTimeout(() => {
-      resolve({ data: comments });
-    }, 1000);
-  });
+  return new Promise(resolve => {});
 };
 

[Survived] BlockStatement
api.js:24:22
 
 export const fetchComments = () => {
   return new Promise(resolve => {
-    setTimeout(() => {
-      resolve({ data: comments });
-    }, 1000);
+    setTimeout(() => {}, 1000);
   });
 };

[Survived] ObjectLiteral
api.js:25:15
 export const fetchComments = () => {
   return new Promise(resolve => {
     setTimeout(() => {
-      resolve({ data: comments });
+      resolve({});
     }, 1000);
   });
