[Survived] ArrayDeclaration
components/App.js:6:38
 import { fetchUsers, fetchPosts, fetchComments } from '../api';
 
 function App() {
-  const [users, setUsers] = useState([]);
+  const [users, setUsers] = useState(["Stryker was here"]);
   const [posts, setPosts] = useState([]);
   const [comments, setComments] = useState([]);

[Survived] ArrayDeclaration
components/App.js:7:38
 
 function App() {
   const [users, setUsers] = useState([]);
-  const [posts, setPosts] = useState([]);
+  const [posts, setPosts] = useState(["Stryker was here"]);
   const [comments, setComments] = useState([]);
 

[Survived] BlockStatement
components/App.js:10:19
   const [posts, setPosts] = useState([]);
   const [comments, setComments] = useState([]);
 
-  useEffect(() => {
-    let isMounted = true;
-
-    const fetchData = async () => {
-      const usersResponse = await fetchUsers();
-      const postsResponse = await fetchPosts();
-      const commentsResponse = await fetchComments();
-
-      if (isMounted) {
-        setUsers(usersResponse.data);
-        setPosts(postsResponse.data);
-        setComments(commentsResponse.data);
-      }
-    };
-
-    fetchData();
-
-    return () => {
-      isMounted = false;
-    };
-  }, []);
+  useEffect(() => {}, []);
 
   return (

[Survived] BlockStatement
components/App.js:13:35
   useEffect(() => {
     let isMounted = true;
 
-    const fetchData = async () => {
-      const usersResponse = await fetchUsers();
-      const postsResponse = await fetchPosts();
-      const commentsResponse = await fetchComments();
-
-      if (isMounted) {
-        setUsers(usersResponse.data);
-        setPosts(postsResponse.data);
-        setComments(commentsResponse.data);
-      }
-    };
+    const fetchData = async () => {};
 
     fetchData();

[Survived] ConditionalExpression
components/App.js:18:11
       const postsResponse = await fetchPosts();
       const commentsResponse = await fetchComments();
 
-      if (isMounted) {
+      if (false) {
         setUsers(usersResponse.data);
         setPosts(postsResponse.data);

[Survived] BlockStatement
components/App.js:18:22
       const postsResponse = await fetchPosts();
       const commentsResponse = await fetchComments();
 
-      if (isMounted) {
-        setUsers(usersResponse.data);
-        setPosts(postsResponse.data);
-        setComments(commentsResponse.data);
-      }
+      if (isMounted) {}
     };
 
