[Survived] BlockStatement
components/Comments.js:3:40
 import React from 'react';
 
-function Comments({ comments, users }) {
-  return (
-    <div>
-      {comments.map(comment => (
-        <div key={comment.id}>
-          <p>{comment.content}</p>
-          <p><strong>{users.find(user => user.id === comment.userId)?.name}</strong></p>
-        </div>
-      ))}
-    </div>
-  );
-}
+function Comments({ comments, users }) {}
 
 export default Comments;

[Survived] ArrowFunction
components/Comments.js:6:21
 function Comments({ comments, users }) {
   return (
     <div>
-      {comments.map(comment => (
-        <div key={comment.id}>
-          <p>{comment.content}</p>
-          <p><strong>{users.find(user => user.id === comment.userId)?.name}</strong></p>
-        </div>
-      ))}
+      {comments.map(() => undefined)}
     </div>
   );

[Survived] ConditionalExpression
components/Comments.js:9:42
       {comments.map(comment => (
         <div key={comment.id}>
           <p>{comment.content}</p>
-          <p><strong>{users.find(user => user.id === comment.userId)?.name}</strong></p>
+          <p><strong>{users.find(user => true)?.name}</strong></p>
         </div>
       ))}

[Survived] ConditionalExpression
components/Comments.js:9:42
       {comments.map(comment => (
         <div key={comment.id}>
           <p>{comment.content}</p>
-          <p><strong>{users.find(user => user.id === comment.userId)?.name}</strong></p>
+          <p><strong>{users.find(user => false)?.name}</strong></p>
         </div>
       ))}
