[Killed] BlockStatement
components/Posts.js:4:44
 import React from 'react';
 import Comments from './Comments';
 
-function Posts({ posts, comments, users }) {
-  return (
-    <div>
-      {posts.map(post => (
-        <div key={post.id}>
-          <h2>{post.title}</h2>
-          <p>{post.content}</p>
-          <h3>Коментарі:</h3>
-          <Comments comments={comments.filter(comment => comment.postId === post.id)} users={users} />
-        </div>
-      ))}
-    </div>
-  );
-}
+function Posts({ posts, comments, users }) {}
 
 export default Posts;
killedBy: renders Eco-Blog title
statusReason: Error: Posts(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Survived] ArrowFunction
components/Posts.js:7:18
 function Posts({ posts, comments, users }) {
   return (
     <div>
-      {posts.map(post => (
-        <div key={post.id}>
-          <h2>{post.title}</h2>
-          <p>{post.content}</p>
-          <h3>Коментарі:</h3>
-          <Comments comments={comments.filter(comment => comment.postId === post.id)} users={users} />
-        </div>
-      ))}
+      {posts.map(() => undefined)}
     </div>
   );

[Survived] ConditionalExpression
components/Posts.js:12:58
           <h2>{post.title}</h2>
           <p>{post.content}</p>
           <h3>Коментарі:</h3>
-          <Comments comments={comments.filter(comment => comment.postId === post.id)} users={users} />
+          <Comments comments={comments.filter(comment => false)} users={users} />
         </div>
       ))}

[Survived] EqualityOperator
components/Posts.js:12:58
           <h2>{post.title}</h2>
           <p>{post.content}</p>
           <h3>Коментарі:</h3>
-          <Comments comments={comments.filter(comment => comment.postId === post.id)} users={users} />
+          <Comments comments={comments.filter(comment => comment.postId !== post.id)} users={users} />
         </div>
       ))}
