[Survived] StringLiteral
jest.config.js:2:24
 module.exports = {
-  setupFilesAfterEnv: ['<rootDir>/jest.setup.js'],
+  setupFilesAfterEnv: [""],
   transform: {
     '^.+\\.(js|jsx)$': 'babel-jest'

[Survived] ArrayDeclaration
jest.config.js:6:28
   transform: {
     '^.+\\.(js|jsx)$': 'babel-jest'
   },
-  transformIgnorePatterns: ['/node_modules/(?!(axios)/)'],
+  transformIgnorePatterns: [],
   moduleNameMapper: {
     '^@components/(.*)$': '<rootDir>/components/$1',

[Survived] StringLiteral
jest.config.js:6:29
   transform: {
     '^.+\\.(js|jsx)$': 'babel-jest'
   },
-  transformIgnorePatterns: ['/node_modules/(?!(axios)/)'],
+  transformIgnorePatterns: [""],
   moduleNameMapper: {
     '^@components/(.*)$': '<rootDir>/components/$1',

[Survived] ObjectLiteral
jest.config.js:7:21
     '^.+\\.(js|jsx)$': 'babel-jest'
   },
   transformIgnorePatterns: ['/node_modules/(?!(axios)/)'],
-  moduleNameMapper: {
-    '^@components/(.*)$': '<rootDir>/components/$1',
-    '^@src/(.*)$': '<rootDir>/src/$1'
-  },
+  moduleNameMapper: {},
   testEnvironment: 'jest-environment-jsdom'
 };
