[Survived] ObjectLiteral
stryker.conf.js:4:18
 /**
  * @type {import('@stryker-mutator/api/core').StrykerOptions}
  */
-module.exports = {
-    mutate: ['**/*.js', '!**/__tests__/**', '!cypress/**'], 
-    testRunner: 'jest',
-    jest: {
-      projectType: 'custom',
-      configFile: 'jest.config.js',
-      enableFindRelatedTests: true,
-    },
-    reporters: ['html', 'clear-text', 'progress'],
-    packageManager: 'npm',
-    coverageAnalysis: 'off',
-    thresholds: {
-      high: 80,
-      low: 60,
-      break: 50
-    }
-  };
+module.exports = {};
   

[Survived] StringLiteral
stryker.conf.js:5:45
  * @type {import('@stryker-mutator/api/core').StrykerOptions}
  */
 module.exports = {
-    mutate: ['**/*.js', '!**/__tests__/**', '!cypress/**'], 
+    mutate: ['**/*.js', '!**/__tests__/**', ""], 
     testRunner: 'jest',
     jest: {

[Survived] StringLiteral
stryker.conf.js:6:17
  */
 module.exports = {
     mutate: ['**/*.js', '!**/__tests__/**', '!cypress/**'], 
-    testRunner: 'jest',
+    testRunner: "",
     jest: {
       projectType: 'custom',

[Survived] ObjectLiteral
stryker.conf.js:7:11
 module.exports = {
     mutate: ['**/*.js', '!**/__tests__/**', '!cypress/**'], 
     testRunner: 'jest',
-    jest: {
-      projectType: 'custom',
-      configFile: 'jest.config.js',
-      enableFindRelatedTests: true,
-    },
+    jest: {},
     reporters: ['html', 'clear-text', 'progress'],
     packageManager: 'npm',

[Survived] StringLiteral
stryker.conf.js:8:20
     mutate: ['**/*.js', '!**/__tests__/**', '!cypress/**'], 
     testRunner: 'jest',
     jest: {
-      projectType: 'custom',
+      projectType: "",
       configFile: 'jest.config.js',
       enableFindRelatedTests: true,

[Survived] StringLiteral
stryker.conf.js:9:19
     testRunner: 'jest',
     jest: {
       projectType: 'custom',
-      configFile: 'jest.config.js',
+      configFile: "",
       enableFindRelatedTests: true,
     },

[Survived] BooleanLiteral
stryker.conf.js:10:31
     jest: {
       projectType: 'custom',
       configFile: 'jest.config.js',
-      enableFindRelatedTests: true,
+      enableFindRelatedTests: false,
     },
     reporters: ['html', 'clear-text', 'progress'],

[Survived] StringLiteral
stryker.conf.js:12:39
       configFile: 'jest.config.js',
       enableFindRelatedTests: true,
     },
-    reporters: ['html', 'clear-text', 'progress'],
+    reporters: ['html', 'clear-text', ""],
     packageManager: 'npm',
     coverageAnalysis: 'off',

[Survived] StringLiteral
stryker.conf.js:13:21
       enableFindRelatedTests: true,
     },
     reporters: ['html', 'clear-text', 'progress'],
-    packageManager: 'npm',
+    packageManager: "",
     coverageAnalysis: 'off',
     thresholds: {

[Survived] ObjectLiteral
stryker.conf.js:15:17
     reporters: ['html', 'clear-text', 'progress'],
     packageManager: 'npm',
     coverageAnalysis: 'off',
-    thresholds: {
-      high: 80,
-      low: 60,
-      break: 50
-    }
+    thresholds: {}
   };
   
